hello,
This is the config:

```resource "flexibleengine_mrs_cluster_v1" "mrs_cluster_test" {
  cluster_name          = "skcmrs01"
  region                = "eu-west-0"
  billing_type          = 12
  master_node_num       = 2
  core_node_num         = 3
  master_node_size      = "s3.2xlarge.4.linux.mrs"
  core_node_size        = "s3.xlarge.4.linux.mrs"
  available_zone_id     = "eu-west-0a"
  vpc_id                = var.vpc_tru
  subnet_id             = module.vpc_tru_subnet_pri.network_id
  cluster_version       = "MRS 2.0.1"
  volume_type           = "SATA"
  volume_size           = 100
  safe_mode             = 0
  cluster_type          = 0
  node_public_cert_name = flexibleengine_compute_keypair_v2.mrs_cluster_key.name
  cluster_admin_secret  = var.mrs_spark_cluster_admin_password

  component_list {
    component_name = "Hadoop"
  }

  component_list {
    component_name = "Spark"
  }

  component_list {
    component_name = "Hive"
  }

  component_list {
    component_name = "Tez"
  }
}

variable "mrs_spark_cluster_admin_password" {
  description = "Admin password for the MRS Cluster Manager"
}

resource "flexibleengine_compute_keypair_v2" "mrs_cluster_key" {
  name       = "mrs_cluster_key"
  public_key = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDN9YY8okQRzwaBhhIlS0xP5w/yoVx0urdrZ2CnsR3Td mrs_cluster@mlm-test-tenant"
}
```
and the debug output:
```
flexibleengine_mrs_cluster_v1.mrs_cluster_test is tainted, so must be replaced
-/+ resource "flexibleengine_mrs_cluster_v1" "mrs_cluster_test" {
        available_zone_id        = "eu-west-0a"
      ~ available_zone_name      = "eu-west-0a" -> (known after apply)
        billing_type             = 12
      + charging_start_time      = (known after apply)
        cluster_admin_secret     = "****"
      ~ cluster_id               = "5b0225be-759a-433e-9180-d3d9366a6293" -> (known after apply)
        cluster_name             = "tsmlmfetruskcmrs01"
      ~ cluster_state            = "running" -> (known after apply)
        cluster_type             = 0
        cluster_version          = "MRS 2.0.1"
        core_node_num            = 3
      ~ core_node_product_id     = "d6c5883255c54b616ce23c3df01c1905" -> (known after apply)
        core_node_size           = "s3.xlarge.4.linux.mrs"
      ~ core_node_spec_id        = "s3.xlarge.4" -> (known after apply)
      + create_at                = (known after apply)
      ~ deployment_id            = "5b0225be-759a-433e-9180-d3d9366a6293" -> (known after apply)
      ~ duration                 = "0" -> (known after apply)
      + error_info               = (known after apply)
      ~ external_alternate_ip    = "100.76.113.153" -> (known after apply)
      ~ external_ip              = "100.76.228.52" -> (known after apply)
      ~ fee                      = "0.0" -> (known after apply)
      + hadoop_version           = (known after apply)
      ~ id                       = "5b0225be-759a-433e-9180-d3d9366a6293" -> (known after apply)
      ~ instance_id              = "5b0225be-759a-433e-9180-d3d9366a6293" -> (known after apply)
      ~ internal_ip              = "10.100.0.137" -> (known after apply)
      + log_collection           = (known after apply)
      ~ master_node_ip           = "10.100.0.137" -> (known after apply)
        master_node_num          = 2
      ~ master_node_product_id   = "d6c5883255c54b616ce23c3df01c1906" -> (known after apply)
        master_node_size         = "s3.2xlarge.4.linux.mrs"
      ~ master_node_spec_id      = "s3.2xlarge.4" -> (known after apply)
        node_public_cert_name    = "mrs_cluster_key"
      ~ order_id                 = "5p9lnFo0RC" -> (known after apply)
      ~ private_ip_first         = "10.100.0.105" -> (known after apply)
        region                   = "eu-west-0"
      + remark                   = (known after apply)
        safe_mode                = 0
      ~ security_groups_id       = "bed6fffc-d97d-455d-8ee7-84b9e4870d8d" -> (known after apply)
      ~ slave_security_groups_id = "bed6fffc-d97d-455d-8ee7-84b9e4870d8d" -> (known after apply)
        subnet_id                = "bf1c68a2-7aca-4221-b3c1-c83a60c5386b"
      ~ tenant_id                = "dd68272202eb4cdc92fecd1fa0bd5e23" -> (known after apply)
      + update_at                = (known after apply)
      ~ vnc                      = "v2/dd68272202eb4cdc92fecd1fa0bd5e23/servers/4de4e61c-7532-4383-a38d-2ec2ac04df36/action" -> (known after apply)
        volume_size              = 100
        volume_type              = "SATA"
        vpc_id                   = "609da0b4-6e76-447b-a3df-f2f9071f402b"
      ~ component_list {
          ~ component_desc    = "A framework that allows for the distributed processing of large data sets across clusters." -> (known after apply)
          ~ component_id      = "MRS 2.0.1_001" -> (known after apply)
            component_name    = "Hadoop"
          ~ component_version = "3.1.1" -> (known after apply)
        }
      ~ component_list {
          ~ component_desc    = "A fast and general engine for large-scale data processing." -> (known after apply)
          ~ component_id      = "MRS 2.0.1_002" -> (known after apply)
            component_name    = "Spark"
          ~ component_version = "2.3.2" -> (known after apply)
        }
      ~ component_list {
          ~ component_desc    = "A data warehouse infrastructure that provides data summarization and ad hoc querying." -> (known after apply)
          ~ component_id      = "MRS 2.0.1_004" -> (known after apply)
            component_name    = "Hive"
          ~ component_version = "3.1.0" -> (known after apply)
        }
      ~ component_list {
          ~ component_desc    = "An application framework which allows for a complex directed-acyclic-graph of tasks for processing data." -> (known after apply)
          ~ component_id      = "MRS 2.0.1_010" -> (known after apply)
            component_name    = "Tez"
          ~ component_version = "0.9.1" -> (known after apply)
        }
    }
```